In [2]:
import pymysql

In [3]:
db = pymysql.connect(user="root",password="sql753",database="mar30")

In [4]:
cr = db.cursor()

#### Read the data from the table

In [5]:
q1 = "select * from course"
cr.execute(q1)

for i in cr:
    print(i)

(121, 'SQL', datetime.date(2022, 4, 15))
(122, 'ML', datetime.date(2022, 5, 1))
(123, 'DL', datetime.date(2022, 3, 20))
(124, 'DS', datetime.date(2022, 3, 1))
(125, 'Tableau', datetime.date(2022, 6, 20))
(126, 'Excel', datetime.date(2022, 6, 1))
(127, 'Power BI', datetime.date(2022, 7, 1))

#### Insert data into table

In [7]:
q2 = "insert into course values (128,'R Programming','2022-08-01')"
cr.execute(q2)
db.commit()

In [9]:
q1 = "select * from course"
cr.execute(q1)

for i in cr:
    print(i)

(121, 'SQL', datetime.date(2022, 4, 15))
(122, 'ML', datetime.date(2022, 5, 1))
(123, 'DL', datetime.date(2022, 3, 20))
(124, 'DS', datetime.date(2022, 3, 1))
(125, 'Tableau', datetime.date(2022, 6, 20))
(126, 'Excel', datetime.date(2022, 6, 1))
(127, 'Power BI', datetime.date(2022, 7, 1))
(128, 'R Programming', datetime.date(2022, 8, 1))

#### Update Query

In [10]:
q3 = "update course set CName='R for Data Science' where CID=128"
cr.execute(q3)
db.commit()

In [11]:
q1 = "select * from course"
cr.execute(q1)

for i in cr:
    print(i)

(121, 'SQL', datetime.date(2022, 4, 15))
(122, 'ML', datetime.date(2022, 5, 1))
(123, 'DL', datetime.date(2022, 3, 20))
(124, 'DS', datetime.date(2022, 3, 1))
(125, 'Tableau', datetime.date(2022, 6, 20))
(126, 'Excel', datetime.date(2022, 6, 1))
(127, 'Power BI', datetime.date(2022, 7, 1))
(128, 'R for Data Science', datetime.date(2022, 8, 1))

#### delete

In [12]:
q4 = "delete from course where CID=128"
cr.execute(q4)
db.commit()

In [13]:
q1 = "select * from course"
cr.execute(q1)

for i in cr:
    print(i)

(121, 'SQL', datetime.date(2022, 4, 15))
(122, 'ML', datetime.date(2022, 5, 1))
(123, 'DL', datetime.date(2022, 3, 20))
(124, 'DS', datetime.date(2022, 3, 1))
(125, 'Tableau', datetime.date(2022, 6, 20))
(126, 'Excel', datetime.date(2022, 6, 1))
(127, 'Power BI', datetime.date(2022, 7, 1))

#### Join Query

In [14]:
q5 = """
select e.eid,e.ename, e.c_id,e.marks,c.cname
from emp e
join course c
on e.c_id = c.cid
where e.marks>75
"""

cr.execute(q5)

8

In [16]:
cr.execute(q5)

for i in cr:
    print(i)

(10, 'Ankush', 121, 78, 'SQL')
(11, 'Shikha', 121, 91, 'SQL')
(12, 'Shreyash', 123, 84, 'DL')
(14, 'Mohit', 125, 76, 'Tableau')
(15, 'Ankit', 125, 89, 'Tableau')
(17, 'Menaakshi', 122, 93, 'ML')
(20, 'Prateek', 126, 81, 'Excel')
(21, 'abc', 126, 83, 'Excel')

In [20]:
db1 = pymysql.connect(user="root",password="sql753")

In [24]:
cr1 = db.cursor()

In [25]:
q7 = "create database Apr15"
cr1.execute(q7)

1

In [26]:
q8 = "use Apr15"
cr1.execute(q8)

0

In [28]:
q9 = """
create table t1(ID int primary key, name varchar(20) not null,city varchar(20))
"""

cr1.execute(q9)
db.commit()